Revit 2027 API
ParameterTypeId.HeadOnPlacementMethod Property
 "Draw in Foreground"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId HeadOnPlacementMethod { get; }
Public Shared ReadOnly Property HeadOnPlacementMethod As ForgeTypeId
	Get
public:
static property ForgeTypeId^ HeadOnPlacementMethod {
	ForgeTypeId^ get ();
}
static member HeadOnPlacementMethod : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace